handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_flash.c
    /* Get the actual read protection L2 Option Byte value */
    if (FLASH_GetReadOutProtectionL2STS() != RESET)
    {
        status_value = FLASH_ERR_RDP2;
    }
    else
    {
        /*No process*/
    }
    
    if(status_value == FLASH_ERR_RDP2)
    {
    
    }
    else
    {
        Option_Bytes_Unlock();
      
        /* Clears the FLASH's pending flags */
        FLASH_ClearFlag(FLASH_STS_CLRFLAG);
        /* Wait for last operation to be completed */
        status_value = FLASH_WaitForLastOpt(ProgramTimeout);
    }

    if (status_value == FLASH_EOP)
    {
        /* Enable the Option Bytes Programming operation */
        FLASH->CTRL |= CTRL_Set_OPTPG;
        /* Restore the last read protection Option Byte value */
        OBT->Data1 = ((uint32_t)option_byte_data1);
        OBT->RESERVED8 = (uint32_t)FLASH_OB_MASK;
        
        /* Wait for last operation to be completed */
        status_value = FLASH_WaitForLastOpt(ProgramTimeout);
        if (status_value != FLASH_TIMEOUT)
        {
            /* if the program operation is completed, disable the OPTPG Bit */
            FLASH->CTRL &= CTRL_Reset_OPTPG;
        }
        else
        {
            /*No process*/
        }
    }
    else
    {
        /*No process*/
    }

    /* Return the Option Byte program status_value */
    return status_value;
}


/**
*\*\name   FLASH_EnWriteProtection
*\*\fun    Write protects the desired pages
*\*\param  FLASH_Pages :(The input parameters must be the following values)
*\*\        - FLASH_WRP_Pages0to7      Enable Write protection of page 0 to 7
*\*\        - FLASH_WRP_Pages8to15     Enable Write protection of page 8 to 15
*\*\        - FLASH_WRP_Pages16to23    Enable Write protection of page 16 to 23
*\*\        - FLASH_WRP_Pages24to31    Enable Write protection of page 24 to 31
*\*\        - FLASH_WRP_Pages32to39    Enable Write protection of page 32 to 39
*\*\        - FLASH_WRP_Pages40to47    Enable Write protection of page 40 to 47
*\*\        - FLASH_WRP_Pages48to55    Enable Write protection of page 48 to 55
*\*\        - FLASH_WRP_Pages56to63    Enable Write protection of page 56 to 63
*\*\        - FLASH_WRP_Pages64to71    Enable Write protection of page 64 to 71
*\*\        - FLASH_WRP_Pages72to79    Enable Write protection of page 72 to 79
*\*\        - FLASH_WRP_Pages80to87    Enable Write protection of page 80 to 87
*\*\        - FLASH_WRP_Pages88to95    Enable Write protection of page 88 to 95
*\*\        - FLASH_WRP_Pages96to103   Enable Write protection of page 96 to 103
*\*\        - FLASH_WRP_Pages104to111  Enable Write protection of page 104 to 111
*\*\        - FLASH_WRP_Pages112to119  Enable Write protection of page 112 to 119
*\*\        - FLASH_WRP_Pages120to127  Enable Write protection of page 120 to 127
*\*\        - FLASH_WRP_Pages128to135  Enable Write protection of page 128 to 135
*\*\        - FLASH_WRP_Pages136to143  Enable Write protection of page 136 to 143
*\*\        - FLASH_WRP_Pages144to151  Enable Write protection of page 144 to 151
*\*\        - FLASH_WRP_Pages152to159  Enable Write protection of page 152 to 159
*\*\        - FLASH_WRP_Pages160to167  Enable Write protection of page 160 to 167
*\*\        - FLASH_WRP_Pages168to175  Enable Write protection of page 168 to 175
*\*\        - FLASH_WRP_Pages176to183  Enable Write protection of page 176 to 183
*\*\        - FLASH_WRP_Pages184to191  Enable Write protection of page 184 to 191
*\*\        - FLASH_WRP_Pages192to199  Enable Write protection of page 192 to 199
*\*\        - FLASH_WRP_Pages200to207  Enable Write protection of page 200 to 207
*\*\        - FLASH_WRP_Pages208to215  Enable Write protection of page 208 to 215
*\*\        - FLASH_WRP_Pages216to223  Enable Write protection of page 216 to 223
*\*\        - FLASH_WRP_Pages224to231  Enable Write protection of page 224 to 231
*\*\        - FLASH_WRP_Pages232to239  Enable Write protection of page 232 to 239
*\*\        - FLASH_WRP_Pages240to247  Enable Write protection of page 240 to 247
*\*\        - FLASH_WRP_Pages248to255  Enable Write protection of page 248 to 255
*\*\        - FLASH_WRP_AllPages       Enable Write protection of all Pages
*\*\        - ~FLASH_WRP_AllPages      Disable Write protection of all Pages
*\*\return FLASH_STS : 
*\*\        - FLASH_BUSY     FLASH is busy
*\*\        - FLASH_ERR_PG   FLASH programming error
*\*\        - FLASH_ERR_WRP  FLASH Write protected error
*\*\        - FLASH_EOP      FLASH End of Operation
*\*\        - FLASH_ERR_RDP2 FLASH is in read protection L2 status
*\*\        - FLASH_TIMEOUT  FLASH operation timeout
**/
FLASH_STS FLASH_EnWriteProtection(uint32_t FLASH_Pages)
{
    uint16_t WRP0_Data, WRP1_Data, WRP2_Data, WRP3_Data;

    FLASH_STS status_value = FLASH_EOP;
    
    uint32_t FLASH_Pages_temp;

    /* Get the actual read protection L2 Option Byte value */
    if (FLASH_GetReadOutProtectionL2STS() != RESET)
    {
        status_value = FLASH_ERR_RDP2;
    }
    else
    {
        /*No process*/
    }
    
    FLASH_Pages_temp = (uint32_t)(~FLASH_Pages);
	WRP0_Data   = (uint16_t)( FLASH_Pages_temp & FLASH_WRP0_MSK);
	WRP1_Data   = (uint16_t)((FLASH_Pages_temp & FLASH_WRP1_MSK) >> FLASH_WRP_WRP1_OFFSET);
	WRP2_Data   = (uint16_t)((FLASH_Pages_temp & FLASH_WRP2_MSK) >> FLASH_WRP_WRP2_OFFSET);
	WRP3_Data   = (uint16_t)((FLASH_Pages_temp & FLASH_WRP3_MSK) >> FLASH_WRP_WRP3_OFFSET);
    
    if(status_value == FLASH_ERR_RDP2)
    {
    
    }
    else
    {
		/* Clears the FLASH's pending flags */
		FLASH_ClearFlag(FLASH_STS_CLRFLAG);
		/* Wait for last operation to be completed */
		status_value = FLASH_WaitForLastOpt(ProgramTimeout);
    }

    if (status_value == FLASH_EOP)
    {
        Option_Bytes_Unlock();
        FLASH->CTRL |= CTRL_Set_OPTPG;

        if (WRP0_Data != 0xFF)
        {
            OBT->WRP0 = (uint32_t)WRP0_Data;
            OBT->RESERVED9 = (uint32_t)FLASH_OB_MASK;

            /* Wait for last operation to be completed */
            status_value = FLASH_WaitForLastOpt(ProgramTimeout);
        }
        else
        {
            /*No process*/
        }
        
        
        if ((WRP1_Data != 0xFF) && (status_value == FLASH_EOP))
        {
            OBT->WRP1 = (uint32_t)WRP1_Data;
            OBT->RESERVED10 = (uint32_t)FLASH_OB_MASK;

            /* Wait for last operation to be completed */
            status_value = FLASH_WaitForLastOpt(ProgramTimeout);
        }
        else
        {
            /*No process*/
        }
        
