handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_flash.c
    if(FLASH_GetOptionBytes_User2_LVR(FLASH_OB_USER_LVR_DISABLE) == SET)
    {
        user2_LVR = FLASH_OB_USER_LVR_DISABLE;
    }
    else
    {
        user2_LVR = FLASH_OB_USER_LVR_ENABLE;
    }
    
    if(FLASH_GetOptionBytes_User2_LVR(FLASH_OB_USER_LVRRST_DISABLE) == SET)
    {
        user2_LVRreset = FLASH_OB_USER_LVRRST_DISABLE;
    }
    else
    {
        user2_LVRreset = FLASH_OB_USER_LVRRST_ENABLE;
    }
    
    if(FLASH_GetOptionBytes_User2_LVR(FLASH_OB_USER_LVRFIL_DISABLE) == SET)
    {
        user2_LVRfilter = FLASH_OB_USER_LVRFIL_DISABLE;
    }
    else
    {
        user2_LVRfilter = FLASH_OB_USER_LVRFIL_ENABLE;
    }

    user3_temp = OBT->USER3;
    user4_temp = OBT->USER4;
    user5_temp = OBT->USER5;
    user6_temp = OBT->USER6;
    data0_temp = OBT->Data0;
    data1_temp = OBT->Data1;
    WP_temp    = FLASH_GetWriteProtectionSTS();
    
    if(status_value == FLASH_EOP)
    {
        
        FLASH_Unlock();
        status_value = FLASH_EraseOB();
    }
    else
    {
        /*No process*/
    }
    
    /* USER1 value write back*/
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_ProgramOptionBytes_USER1(user1_iwdg,user1_stop,user1_PD,user1_nBOOT0,\
												      user1_nBOOT1,user1_nSWBOOT0,user1_BOOT0_CFG);
    }
	else
	{
		/* no process*/
	}
	
	if(status_value == FLASH_EOP)
    {
        status_value = FLASH_ProgramOptionBytes_USER2(user2_LVRcnt,user2_LVR,user2_LVRreset,user2_LVRfilter);
    }
	else
	{
		/* no process*/
	}
    
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_ProgramOptionBytes_USER3(user3_temp);
    }
	else
	{
		/* no process*/
	}
    
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_ProgramOptionBytes_USER4(user4_temp);
    }
	else
	{
		/* no process*/
	}
	
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_ProgramOptionBytes_USER5(user5_temp);
    }
	else
	{
		/* no process*/
	}
    
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_ProgramOptionBytes_USER6(user6_temp);
    }
	else
	{
		/* no process*/
	}
    
    /* Programs DATA0~DATA1 */
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_ProgramOptionBytes_DATA0(data0_temp);
    }
	else
	{
		/* no process*/
	}
    
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_ProgramOptionBytes_DATA1(data1_temp);
    }
	else
	{
		/* no process*/
	}
    
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_EnWriteProtection(~WP_temp);
    }
	else
	{
		/* no process*/
	}
    
    if(status_value == FLASH_EOP)
    {
        if (Cmd != DISABLE)
        {
            /* Enables the read out protection L1 */
            status_value = FLASH_ProgramOptionBytes_RDP1(FLASH_OB_RDP1_ENABLE);
        }
        else
        {
            /* Disables the read out protection L1 */
            status_value = FLASH_ProgramOptionBytes_RDP1(FLASH_OB_RDP1_DISABLE);
        }    
    }
    else
	{
		/* no process*/
	}
  
    /* Return the protection operation status_value */
    return status_value;
}


/**
*\*\name   FLASH_ReadOutProtectionL2_ENABLE
*\*\fun    Enables the read out protection L2.
*\*\param  none
*\*\return FLASH_STS : 
*\*\        - FLASH_BUSY     FLASH is busy
*\*\        - FLASH_ERR_PG   FLASH programming error
*\*\        - FLASH_ERR_WRP  FLASH Write protected error
*\*\        - FLASH_EOP      FLASH End of Operation
*\*\        - FLASH_ERR_RDP2 FLASH is in read protection L2 status
*\*\        - FLASH_TIMEOUT  FLASH operation timeout
**/
FLASH_STS FLASH_ReadOutProtectionL2_ENABLE(void)
{
    uint32_t user1_iwdg,user1_stop,user1_PD,user1_nBOOT0,user1_nBOOT1,user1_nSWBOOT0,user1_BOOT0_CFG;
    uint32_t user2_LVRcnt,user2_LVR,user2_LVRreset,user2_LVRfilter;    
    uint32_t user3_temp,user4_temp,user5_temp,user6_temp;
    uint32_t data0_temp,data1_temp;
	uint32_t WP_temp;
    FLASH_STS status_value = FLASH_EOP;

    /* Get the actual read protection L2 Option Byte value */
    if (FLASH_GetReadOutProtectionL2STS() != RESET)
    {
        status_value = FLASH_ERR_RDP2;
    }
    else
    {
        /*No process*/
    }
	
    if(FLASH_GetOptionBytes_User1(FLASH_OB_IWDG_SOFTWARE) == SET)
    {
        user1_iwdg = FLASH_OB_IWDG_SOFTWARE;
    }
	else
	{
		user1_iwdg = FLASH_OB_IWDG_HARDWARE;
	}
	
	if(FLASH_GetOptionBytes_User1(FLASH_OB_STOP_NORST) == SET)
    {
        user1_stop = FLASH_OB_STOP_NORST;
    }
	else
	{
		user1_stop = FLASH_OB_STOP_RST;
	}
	
	if(FLASH_GetOptionBytes_User1(FLASH_OB_PD_NORST) == SET)
    {
        user1_PD = FLASH_OB_PD_NORST;
    }
	else
	{
		user1_PD = FLASH_OB_PD_RST;
	}
	
	if(FLASH_GetOptionBytes_User1(FLASH_OB_NBOOT0_SET) == SET)
    {
        user1_nBOOT0 = FLASH_OB_NBOOT0_SET;
    }
	else
	{
		user1_nBOOT0 = FLASH_OB_NBOOT0_CLR;
	}
	
	if(FLASH_GetOptionBytes_User1(FLASH_OB_NBOOT1_SET) == SET)
    {
        user1_nBOOT1 = FLASH_OB_NBOOT1_SET;
    }
	else
	{
		user1_nBOOT1 = FLASH_OB_NBOOT1_CLR;
	}
	
	if(FLASH_GetOptionBytes_User1(FLASH_OB_NSWBOOT0_SET) == SET)
    {
        user1_nSWBOOT0 = FLASH_OB_NSWBOOT0_SET;
    }
	else
	{
		user1_nSWBOOT0 = FLASH_OB_NSWBOOT0_CLR;
	}
	
	if(FLASH_GetOptionBytes_User1(FLASH_OB_BOOT0_CFG_HIGH) == SET)
    {
        user1_BOOT0_CFG = FLASH_OB_BOOT0_CFG_HIGH;
    }
	else
	{
		user1_BOOT0_CFG = FLASH_OB_BOOT0_CFG_LOW;
	}
	
	user2_LVRcnt = FLASH_GetOptionBytes_User2_LVRLS();
	if(FLASH_GetOptionBytes_User2_LVR(FLASH_OB_USER_LVR_DISABLE) == SET)
    {
        user2_LVR = FLASH_OB_USER_LVR_DISABLE;
    }
	else
	{
		user2_LVR = FLASH_OB_USER_LVR_ENABLE;
	}
	
	if(FLASH_GetOptionBytes_User2_LVR(FLASH_OB_USER_LVR_DISABLE) == SET)
    {
        user2_LVR = FLASH_OB_USER_LVR_DISABLE;
    }
	else
	{
		user2_LVR = FLASH_OB_USER_LVR_ENABLE;
	}
	
	if(FLASH_GetOptionBytes_User2_LVR(FLASH_OB_USER_LVRRST_DISABLE) == SET)
    {
        user2_LVRreset = FLASH_OB_USER_LVRRST_DISABLE;
    }
	else
	{
		user2_LVRreset = FLASH_OB_USER_LVRRST_ENABLE;
	}
	
	if(FLASH_GetOptionBytes_User2_LVR(FLASH_OB_USER_LVRFIL_DISABLE) == SET)
    {
        user2_LVRfilter = FLASH_OB_USER_LVRFIL_DISABLE;
    }
	else
	{
		user2_LVRfilter = FLASH_OB_USER_LVRFIL_ENABLE;
	}

